export const theme = Object.freeze({
  colors: {
    background: '#E0E5EC', // Основной фон сайта: светло-голубой для чистого и нейтрального вида
    backgroundSecondary: '#2B3A67', // Второй фон сайта для хедера и футера: темно-синий для хорошего контраста
    backgroundMenu: '#A8B8D8', // Цвет для открывающегося меню: средне-голубой для плавного перехода

    title: '#1C2541', // Цвет заголовков и текста: темно-синий для хорошей читаемости и контраста

    text: '#3A506B', // Основной цвет текста: серо-синий для удобного чтения
    textWhite: '#FFF', //
    textSecondary: '#5C6B8C', // Второй цвет текста для выделения: более светлый оттенок серо-синего

    btn: '#008891', // Цвет кнопок основной: насыщенный бирюзовый для акцента
    bthHover: '#00A3A9', // Цвет кнопок для hover и фокуса: светло-бирюзовый для выделения
    bthDisabled: '#999', // Цвет кнопок для hover и фокуса: светло-бирюзовый для выделения

    accent: '#FF9F1C', // Цвет акцента для выделения: яркий оранжевый для привлечения внимания к важным элементам
  },
});
